'''
База словарей для 4 Домашнего Задания
'''

# словарь с названиями и жанрами сериалов
shows = {'Секретные материалы': 'фантастика',
         'Ведьмак': 'фэнтази',
         'Клан Сопрано': 'криминал',
         '24': 'драма',
         'Черное зеркало': 'фантастика',
         'Во все тяжкие': 'криминал',
         'Игра престолов': 'фэнтази',
         'Карточный домик': 'драма',
         'Рик и Морти': 'фантастика'}

ratings = {'Секретные материалы': 0.9,
           'Ведьмак': 0.95,
           'Клан Сопрано': 0.8,
           '24': 0.75,
           'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85,
           'Игра престолов': 0.87,
           'Карточный домик': 0.82,
           'Рик и Морти': 1}

anya = {'Секретные материалы': 'фантастика',
        'Карточный домик': 'драма',
        'Рик и Морти': 'фантастика'}

olya = {'Клан Сопрано': 'криминал',
        '24': 'драма',
        'Во все тяжкие': 'криминал',
        'Карточный домик': 'драма'} 

nastya = {'Ведьмак': 'фэнтази',
          'Игра престолов': 'фэнтази'}

sveta = {'Черное зеркало': 'фантастика',
         'Карточный домик': 'драма',
         'Рик и Морти': 'фантастика'}
