'''
- Программа приветствует игрока в виртуальном казино.
- Игроку предоставляется депозит в 10 000 единиц.
- Программа “бросает кубики” и получает случайное число (используйте модуль random)
  в промежутке от 2 до 12.
- Программа просит пользователя угадать число и сравнивает введенное игроком число с тем,
  которое она загадала. Если пользователь угадал, то ему начисляется 1000 единиц. Если не угадал,
  то от депозита отнимается 1000 единиц.
- Игра продолжается до тех пор, пока у пользователя не кончаются единицы на депозите
  (используйте цикл while).
'''