shows = {'Секретные материалы': 'фантастика',
         'Ведьмак': 'фэнтази',
         'Клан Сопрано': 'криминал',
         '24': 'драма',
         'Черное зеркало': 'фантастика',
         'Во все тяжкие': 'криминал',
         'Игра престолов': 'фэнтази',
         'Карточный домик': 'драма',
         'Рик и Морти': 'фантастика'}

ratings = {'Секретные материалы': 0.9,
           'Ведьмак': 0.95,
           'Клан Сопрано': 0.8,
           '24': 0.75,
           'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85,
           'Игра престолов': 0.87,
           'Карточный домик': 0.82,
           'Рик и Морти': 1}

animals = ['питон', 'питон', 'кит', 'собака', 'питон', 'кит', 'кошка',
           'горилла', 'кит', 'кошка', 'жираф', 'леопард', 'жираф',
           'жираф', 'кошка', 'горилла', 'жираф', 'жираф', 'кошка',
           'жираф', 'кошка', 'кошка', 'собака', 'кит', 'жираф',
           'леопард', 'жираф', 'собака', 'кит', 'кит', 'кит',
           'жираф', 'собака', 'собака', 'кит', 'питон', 'леопард',
           'кошка', 'жираф', 'собака', 'кошка', 'жираф', 'кошка',
           'собака', 'кит', 'леопард', 'леопард', 'горилла', 'горилла', 'кит']
